dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMcdslight_regdef.h
/** \brief Trace Buffer Comparator Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_FIFOWARN_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_FIFOWARN;

/** \brief Module Identification Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_ID_Bits B;          /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_ID;

/** \brief Action Definition Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_MCXACT_Bits B;      /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_MCXACT;

/** \brief Event Definition Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_MCXEVT_Bits B;      /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_MCXEVT;

/** \brief Counter Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_MCX_CCL_Bits B;     /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_MCX_CCL;

/** \brief Current Count Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_MCX_CNT_Bits B;     /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_MCX_CNT;

/** \brief Counter Limit Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_MCX_LMT_Bits B;     /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_MCX_LMT;

/** \brief MCDS Signal Source Control   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_MUX_Bits B;         /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_MUX;

/** \brief MCDS_TC Signal Source Control   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_MUX_TC_RC_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_MUX_TC_RC;

/** \brief OCDS Control and Status   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_OCS_Bits B;         /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_OCS;

/** \brief Session ID High Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_SESSIDH_Bits B;     /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_SESSIDH;

/** \brief Session ID Low Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_SESSIDL_Bits B;     /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_SESSIDL;

/** \brief Action Definition Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCXACT_Bits B;      /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCXACT;

/** \brief Comparator Bound Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCXAC_BND_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCXAC_BND;

/** \brief Comparator Mask Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCXAC_MSK_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCXAC_MSK;

/** \brief Comparator Range Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCXAC_RNG_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCXAC_RNG;

/** \brief Compact Function Trace Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCXCFT_Bits B;      /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCXCFT;

/** \brief Current Instruction Pointer   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCXCIP_Bits B;      /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCXCIP;

/** \brief Debug Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCXDCSTS_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCXDCSTS;

/** \brief DTU FIFOs Fill Level   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCXDTUFLV_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCXDTUFLV;

/** \brief Comparator Bound Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCXEA_BND_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCXEA_BND;

/** \brief Comparator Range Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCXEA_RNG_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCXEA_RNG;

