dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMcdslight_regdef.h
/** \brief Comparator Bound Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCYEA_BND_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCYEA_BND;

/** \brief Comparator Range Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCYEA_RNG_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCYEA_RNG;

/** \brief Event Definition Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCYEVT_Bits B;      /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCYEVT;

/** \brief Comparator Bound Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCYIP_BND_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCYIP_BND;

/** \brief Comparator Range Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCYIP_RNG_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCYIP_RNG;

/** \brief Lookup Table Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCYPALLUTA_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCYPALLUTA;

/** \brief Lookup Table Data Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCYPALLUTD_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCYPALLUTD;

/** \brief Lookup Table Base Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCYPAL_BND_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCYPAL_BND;

/** \brief Lookup Table Mapping Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCYPAL_MAP_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCYPAL_MAP;

/** \brief Lookup Table Range Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCYPAL_RNG_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCYPAL_RNG;

/** \brief Comparator Bound Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCYWD_BND_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCYWD_BND;

/** \brief Comparator Bound Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCYWD_HBND_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCYWD_HBND;

/** \brief Comparator Mask Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCYWD_HMSK_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCYWD_HMSK;

/** \brief Comparator Range Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCYWD_HRNG_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCYWD_HRNG;

/** \brief Comparator Mask Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCYWD_MSK_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCYWD_MSK;

/** \brief Comparator Range Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCYWD_RNG_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCYWD_RNG;

/** \brief Comparator Sign Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TCYWD_SGN_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TCYWD_SGN;

/** \brief Clock Counter Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TSUEMUCNT_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TSUEMUCNT;

/** \brief Clock Prescaler Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TSUPRSCL_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TSUPRSCL;

/** \brief Clock Counter Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDSLIGHT_TSUREFCNT_Bits B;    /**< \brief Bitfield access */
} Ifx_MCDSLIGHT_TSUREFCNT;

/** \}  */

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcdslight_MCX_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief MCX object */
typedef volatile struct _Ifx_MCDSLIGHT_MCX
{
       Ifx_MCDSLIGHT_MCX_CCL               CCL;                    /**< \brief 0, Counter Control Register*/
       Ifx_MCDSLIGHT_MCX_LMT               LMT;                    /**< \brief 4, Counter Limit Register*/
       Ifx_MCDSLIGHT_MCX_CNT               CNT;                    /**< \brief 8, Current Count Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
} Ifx_MCDSLIGHT_MCX;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcdslight_TCXPAL_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCXPAL object */
typedef volatile struct _Ifx_MCDSLIGHT_TCXPAL
{
       Ifx_MCDSLIGHT_TCXPAL_BND            BND;                    /**< \brief 0, Lookup Table Base Register*/
       Ifx_MCDSLIGHT_TCXPAL_RNG            RNG;                    /**< \brief 4, Lookup Table Range Register*/
       Ifx_MCDSLIGHT_TCXPAL_MAP            MAP;                    /**< \brief 8, Lookup Table Mapping Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
} Ifx_MCDSLIGHT_TCXPAL;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcdslight_TCXEA_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCXEA object */
typedef volatile struct _Ifx_MCDSLIGHT_TCXEA
{
       Ifx_MCDSLIGHT_TCXEA_BND             BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDSLIGHT_TCXEA_RNG             RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_MCDSLIGHT_TCXEA;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcdslight_TCXWD_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCXWD object */
typedef volatile struct _Ifx_MCDSLIGHT_TCXWD
{
       Ifx_MCDSLIGHT_TCXWD_BND             BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDSLIGHT_TCXWD_HBND            HBND;                   /**< \brief 4, Comparator Bound Register ${x}*/
       Ifx_MCDSLIGHT_TCXWD_RNG             RNG;                    /**< \brief 8, Comparator Range Register ${x}*/
       Ifx_MCDSLIGHT_TCXWD_HRNG            HRNG;                   /**< \brief C, Comparator Range Register ${x}*/
       Ifx_MCDSLIGHT_TCXWD_MSK             MSK;                    /**< \brief 10, Comparator Mask Register ${x}*/
       Ifx_MCDSLIGHT_TCXWD_HMSK            HMSK;                   /**< \brief 14, Comparator Mask Register ${x}*/
       Ifx_UReg_8Bit                       reserved_18[4];         /**< \brief 18, \internal Reserved */
       Ifx_MCDSLIGHT_TCXWD_SGN             SGN;                    /**< \brief 1C, Comparator Sign Register ${x}*/
} Ifx_MCDSLIGHT_TCXWD;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcdslight_TCXAC_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCXAC object */
typedef volatile struct _Ifx_MCDSLIGHT_TCXAC
{
       Ifx_MCDSLIGHT_TCXAC_BND             BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDSLIGHT_TCXAC_RNG             RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_MCDSLIGHT_TCXAC_MSK             MSK;                    /**< \brief 8, Comparator Mask Register ${x}*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
} Ifx_MCDSLIGHT_TCXAC;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcdslight_TCXIP_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCXIP object */
typedef volatile struct _Ifx_MCDSLIGHT_TCXIP
{
       Ifx_MCDSLIGHT_TCXIP_BND             BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDSLIGHT_TCXIP_RNG             RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_MCDSLIGHT_TCXIP;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcdslight_TCYPAL_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCYPAL object */
typedef volatile struct _Ifx_MCDSLIGHT_TCYPAL
{
       Ifx_MCDSLIGHT_TCYPAL_BND            BND;                    /**< \brief 0, Lookup Table Base Register*/
       Ifx_MCDSLIGHT_TCYPAL_RNG            RNG;                    /**< \brief 4, Lookup Table Range Register*/
       Ifx_MCDSLIGHT_TCYPAL_MAP            MAP;                    /**< \brief 8, Lookup Table Mapping Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
} Ifx_MCDSLIGHT_TCYPAL;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcdslight_TCYEA_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCYEA object */
typedef volatile struct _Ifx_MCDSLIGHT_TCYEA
{
       Ifx_MCDSLIGHT_TCYEA_BND             BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDSLIGHT_TCYEA_RNG             RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_MCDSLIGHT_TCYEA;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcdslight_TCYWD_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCYWD object */
typedef volatile struct _Ifx_MCDSLIGHT_TCYWD
{
       Ifx_MCDSLIGHT_TCYWD_BND             BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDSLIGHT_TCYWD_HBND            HBND;                   /**< \brief 4, Comparator Bound Register ${x}*/
       Ifx_MCDSLIGHT_TCYWD_RNG             RNG;                    /**< \brief 8, Comparator Range Register ${x}*/
       Ifx_MCDSLIGHT_TCYWD_HRNG            HRNG;                   /**< \brief C, Comparator Range Register ${x}*/
       Ifx_MCDSLIGHT_TCYWD_MSK             MSK;                    /**< \brief 10, Comparator Mask Register ${x}*/
       Ifx_MCDSLIGHT_TCYWD_HMSK            HMSK;                   /**< \brief 14, Comparator Mask Register ${x}*/
       Ifx_UReg_8Bit                       reserved_18[4];         /**< \brief 18, \internal Reserved */
       Ifx_MCDSLIGHT_TCYWD_SGN             SGN;                    /**< \brief 1C, Comparator Sign Register ${x}*/
} Ifx_MCDSLIGHT_TCYWD;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcdslight_TCYAC_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCYAC object */
typedef volatile struct _Ifx_MCDSLIGHT_TCYAC
{
       Ifx_MCDSLIGHT_TCYAC_BND             BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDSLIGHT_TCYAC_RNG             RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_MCDSLIGHT_TCYAC_MSK             MSK;                    /**< \brief 8, Comparator Mask Register ${x}*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
} Ifx_MCDSLIGHT_TCYAC;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcdslight_TCYIP_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCYIP object */
typedef volatile struct _Ifx_MCDSLIGHT_TCYIP
{
       Ifx_MCDSLIGHT_TCYIP_BND             BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDSLIGHT_TCYIP_RNG             RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_MCDSLIGHT_TCYIP;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/** \addtogroup IfxSfr_Mcdslight_Registers_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

